Tekla Open API Reference for Tekla Structures 2025
PlacingTypes Methods
The PlacingTypes type exposes the following members.
Methods
Name | Description
AlongLinePlacing
 The object is located and moved along a line defined by two points.
BaseLinePlacing
 The object is placed using a line as a reference. This will thus define the object's X-axis along that line.
LeaderLinePlacing
 The object is placed attached to a leader line.
PointPlacing
 The object is placed at one point (the insertion point) without any additional placing options.
Top
See Also
Reference
PlacingTypes Class
Tekla.Structures.Drawing Namespace